{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<h1 style=\"color:MediumBlue;\"> 1025. Демократия в опасности </h1>\n",
    "\n",
    "<h4 style=\"color:MediumBlue;\">Вступление</h4>\n",
    "В одном из островных государств Карибского бассейна все решения традиционно принимались простым большинством голосов на общем собрании граждан, которых, к счастью, было не очень много. Одна из местных партий, стремясь прийти к власти как можно более законным путем, смогла добиться некоторой реформы избирательной системы. Главным аргументом было то, что население острова в последнее время значительно возросло, и проведение общих собраний перестало быть легкой задачей.<br/><br/>\n",
    "Суть реформы состояла в следующем: с момента введения ее в действие все избиратели острова делились на K групп (необязательно равных по численности). Голосование по любому вопросу теперь следовало проводить отдельно в каждой группе, причем считалось, что группа высказывается «за», если «за» голосует более половины людей в этой группе, а в противном случае считалось, что группа высказывается «против». После проведения голосования в группах подсчитывалось количество групп, высказавшихся «за» и «против», и вопрос решался положительно в том и только том случае, когда групп, высказавшихся «за», оказывалось более половины общего количества групп.<br/><br/>\n",
    "Эта система вначале была с радостью принята жителями острова. Когда первые восторги рассеялись, очевидны стали, однако, некоторые недостатки новой системы. Оказалось, что сторонники партии, предложившей систему, смогли оказать некоторое влияние на формирование групп избирателей. Благодаря этому, они получили возможность проводить некоторые решения, не обладая при этом реальным большинством голосов!<br/><br/>\n",
    "Пусть, например, на острове были сформированы три группы избирателей, численностью в 5, 5 и 7 человек соответственно. Тогда партии достаточно иметь трех сторонников в каждой из первых двух групп, и она сможет провести решение всего шестью голосами «за», вместо девяти, необходимых при общем голосовании.\n",
    "<h4 style=\"color:MediumBlue;\">Задача</h4>\n",
    "Вам надо написать программу, которая определяет по заданному разбиению избирателей на группы минимальное количество сторонников партии, достаточное, при некотором распределении их по группам, для принятия любого решения.\n",
    "<h4 style=\"color:MediumBlue;\">Исходные данные</h4>\n",
    "В первой строке записано нечётное число K — количество групп избирателей (1 ≤ K ≤ 101). Во второй строке через пробел записаны K нечётных чисел, которые задают количество избирателей в группах. Население острова не превосходит 9999 человек.\n",
    "<h4 style=\"color:MediumBlue;\">Результат</h4>\n",
    "Выведите минимальное количество сторонников партии, способное решить исход голосования.\n",
    "<br/><br/><p>Задача доступна по <a href=\"https://acm.timus.ru/problem.aspx?space=1&num=1025\">ссылке</a></p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# К - количество групп избирателей\n",
    "# voters_in_the_group - массив с количеством избирателей в каждой группе\n",
    "# number_of_required_voters - количество нужных избирателей\n",
    "    \n",
    "# Идея такая: нужно взять половину плюс одну группу, чтобы получить большинство по группам,\n",
    "# а чтобы затратить на это меньшее количество избирателей, будем рассматривать только те группы,\n",
    "# где их количество меньше. И в каждой такой группе будем выбирать половину плюс одного избирателей, \n",
    "# чтобы получить большинство в группе."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "K = int(input())\n",
    "voters_in_the_group = [int(i) for i in input().split()]\n",
    " \n",
    "voters_in_the_group.sort()\n",
    "    \n",
    "number_of_required_voters = 0\n",
    "\n",
    "for i in range(K//2+1):\n",
    "    number_of_required_voters += voters_in_the_group[i]//2+1\n",
    "    \n",
    "print(number_of_required_voters)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
